# Ultralytics YOLO11 + CBAM 增强版

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ------------------------------------------------------
# Backbone with CBAM
# ------------------------------------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0
  - [-1, 1, CBAM, [64]]             # 1

  - [-1, 1, Conv, [128, 3, 2]]      # 2
  - [-1, 1, CBAM, [128]]            # 3

  - [-1, 2, C3k2, [256, False, 0.25]]  # 4

  - [-1, 1, Conv, [256, 3, 2]]      # 5
  - [-1, 1, CBAM, [256]]            # 6

  - [-1, 2, C3k2, [512, False, 0.25]]  # 7

  - [-1, 1, Conv, [512, 3, 2]]      # 8
  - [-1, 2, C3k2, [512, True]]      # 9

  - [-1, 1, Conv, [1024, 3, 2]]     # 10
  - [-1, 2, C3k2, [1024, True]]     # 11

  - [-1, 1, CBAM, [1024]]           # 12 (SPPF 前 CBAM)
  - [-1, 1, SPPF, [1024, 5]]        # 13
  - [-1, 2, C2PSA, [1024]]          # 14  ← backbone 输出

# ------------------------------------------------------
# Head（层号全部按 CBAM 插入后的实际值修复）
# ------------------------------------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 15
  - [[-1, 9], 1, Concat, [1]]                     # 16 (与 P4 拼接，原P4在 backbone 的第9层)
  - [-1, 2, C3k2, [512, False]]                   # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 18
  - [[-1, 6], 1, Concat, [1]]                     # 19 (与 P3 拼接，原P3在 backbone 第6层)
  - [-1, 2, C3k2, [256, False]]                   # 20  ← P3 输出

  - [-1, 1, Conv, [256, 3, 2]]                    # 21
  - [[-1, 17], 1, Concat, [1]]                    # 22 (与 head P4 拼接)
  - [-1, 2, C3k2, [512, False]]                   # 23  ← P4 输出

  - [-1, 1, Conv, [512, 3, 2]]                    # 24
  - [[-1, 14], 1, Concat, [1]]                    # 25 (与 backbone P5 拼接)
  - [-1, 2, C3k2, [1024, True]]                   # 26  ← P5 输出

  - [[20, 23, 26], 1, Detect, [nc]]               # Detect
