# YOLO11m with CBAM attention mechanism
# Parameters
nc: 1  # number of classes (行人检测)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.67, 0.75, 768]   # YOLOv11m
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv11.0m backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, CBAM, [7]]  # 5-添加CBAM注意力，kernel_size=7
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 2, C3k2, [512, True]]  # 7
  - [-1, 1, CBAM, [7]]  # 8-添加CBAM注意力，kernel_size=7
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]  # 10
  - [-1, 1, SPPF, [1024, 5]]  # 11

# YOLOv11.0m head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[-1, 7], 1, Concat, [1]]  # 13 cat backbone P4
  - [-1, 2, C3k2, [512, False]]  # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 4], 1, Concat, [1]]  # 16 cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 17 (P3/8-small)
  - [-1, 1, Conv, [256, 3, 2]]  # 18
  - [[-1, 14], 1, Concat, [1]]  # 19 cat head P4
  - [-1, 2, C3k2, [512, False]]  # 20 (P4/16-medium)
  - [-1, 1, Conv, [512, 3, 2]]  # 21
  - [[-1, 11], 1, Concat, [1]]  # 22 cat head P5
  - [-1, 2, C3k2, [1024, False]]  # 23 (P5/32-large)
  - [[17, 20, 23], 1, Detect, [nc]]  # 24 Detect(P3, P4, P5)